---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotElevRelativeBase
source: html/1ee5553e-daf9-9974-608e-1af917b5e3b2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotElevRelativeBase Property

"Relative Base"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotElevRelativeBase { get; }
```